<template>
  <div class="list-container">
    <div
      v-for="(item, index) in list"
      :key="index"
      class="list-item"
    >
      <auto-show-tip-comp
        :tip-text="item.tipText"
        :line-num="item.lineNum"
      >
        <el-tag size="small" class="tag" effect="plain">标签一</el-tag>
        <el-tag size="small" class="tag" effect="plain">标签二</el-tag>
        <span class="title">{{ item.title }}</span>
      </auto-show-tip-comp>
    </div>
    <code-block-comp :src-code="listStr" />
  </div>
</template>

<script>
import AutoShowTipComp from '@/components/AutoShowTipComp'
import CodeBlockComp from '@/components/CodeBlockComp'
export default {
  name: '',
  components: { AutoShowTipComp, CodeBlockComp },
  data () {
    return {
      list: [
        {
          title: '这是一个标题',
          tipText: '这是一个标题',
          lineNum: 1
        },
        {
          title: '这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的',
          tipText: '这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的',
          lineNum: 1
        },
        {
          title: '这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长',
          tipText: '这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长',
          lineNum: 1
        },
        {
          title: '这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的',
          tipText: '这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的',
          lineNum: 2
        },
        {
          title: '这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的',
          tipText: '这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的',
          lineNum: 2
        },
        {
          title: '这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的',
          tipText: '这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的这是标题很长的',
          lineNum: 3
        },
        {
          title: '这是一个标题',
          tipText: '这是一个标题',
          lineNum: 4
        },
        {
          title: '这是一个标题',
          tipText: '这是一个标题',
          lineNum: 4
        },
        {
          title: '这是一个标题',
          tipText: '这是一个标题',
          lineNum: 1
        },
        {
          title: '这是一个标题',
          tipText: '这是一个标题',
          lineNum: 1
        }
      ]
    }
  },
  computed: {
    listStr () {
      return JSON.stringify(this.list)
    }
  },
  mounted () {

  },
  methods: {

  }
}
</script>

<style lang="scss" scoped>
  .list-item {
    margin-bottom: 16px;
  }
  .title {
    line-height: 22px;
  }
  .tag {
    margin-right: 16px;
  }
</style>
